Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་སུ་དམིགས་པ་མ་མཆིས་སོ། །མ་རིག་པར་དམིགས་པ་མ་མ་མཆིས། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: They do not apprehend the earth element, and they do not apprehend the water element, the fire element, the wind element, the space element, or the consciousness element.

source: མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་། སྲེད་པ་དང་། ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤིར་དམིགས་པ་མ་མཆིས་སོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པར་དམིགས་པ་མ་མཆིས།
en: They do not apprehend ignorance, and they do not apprehend formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, or aging and death.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར་དམིགས་པ་མ་མཆིས་སོ།
en: They do not apprehend the perfection of generosity, and they do not apprehend the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: །ནང་སྟོང་པ་ཉིད་དུ་དམིགས་པ་མ་མཆིས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་དམིགས་པ་མ་མཆིས་སོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སུ་དམིགས་པ་མ་མཆིས། ཡང་དག་པར་སྤོང་བ་དང་།
en: They do not apprehend the emptiness of internal phenomena, and they do not apprehend [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པར་དམིགས་པ་མ་མཆིས་སོ།
en: They do not apprehend the applications of mindfulness, and they do not apprehend the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path.

source: །འཕགས་པའི་བདེན་པ་རྣམས་སུ་དམིགས་པ་མ་མཆིས་སོ། །བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སུ་དམིགས་པ་མ་མཆིས་སོ།
en: They do not apprehend the truths of the noble ones, and they do not apprehend the meditative concentrations, the immeasurable attitudes, or the formless absorptions.

source: །རྣམ་པར་ཐར་པ་བརྒྱད་དུ་དམིགས་པ་མ་མ་མཆིས། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་རྣམས་སུ་དམིགས་པ་མ་མཆིས་སོ།
en: They do not apprehend the eight aspects of liberation, and they do not apprehend the nine serial steps of meditative absorption, the three gateways of liberation, or the extrasensory powers.

source: །ཏིང་ངེ་འཛིན་རྣམས་སུ་དམིགས་པ་མ་མཆིས་སོ། །གཟུངས་ཀྱི་སྒོ་རྣམས་སུ་དམིགས་པ་མ་མཆིས་སོ།
en: They do not apprehend the meditative stabilities, and they do not apprehend the dhāraṇī gateways. {Ki.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་སུ་དམིགས་པ་མ་མ་མཆིས། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སུ་དམིགས་པ་མ་མཆིས་སོ།
en: II-III: 99} They do not apprehend the powers of the tathāgatas, and they do not apprehend the fearlessnesses, the kinds of exact knowledge, [great loving kindness], great compassion, or the distinct qualities of the buddhas.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུར་དམིགས་པ་མ་མཆིས། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དུ་དམིགས་པ་མ་མཆིས་སོ།
en: They do not apprehend the fruit of entering the stream to nirvāṇa, and they do not apprehend the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, or arhatship.

source: །རང་བྱང་ཆུབ་ཏུ་དམིགས་པ་མ་མཆིས་སོ། །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། བྱང་ཆུབ་དང་། སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་སུ་དམིགས་པ་མ་མཆིས་ཏེ།
en: They do not apprehend individual enlightenment, and they do not apprehend knowledge of the path, enlightenment, the buddhas, or the attributes of the buddhas.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དམིགས་པའི་ཚུལ་དུ་ཉེ་བར་གནས་པ་མ་ལགས་སོ།
en: The perfection of wisdom does not establish anything by way of apprehending.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་གིས་དམིགས་པར་བགྱི་བ་དང་། གང་ལ་དམིགས་པར་བགྱི་བ་དང་། གང་དུ་དམིགས་པར་བགྱི་བ་དེ་ལྟ་བུའི་ངོ་བོ་ཉིད་དེ་ལ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: If one were to ask why, it is because the essential nature [of phenomena] does not exist, so that it is not apprehended by anything, there is nothing that is apprehended, and nothing in which it could be apprehended.” “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་མི་དམིགས་པའི་ཚུལ་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡུན་རིང་པོར་སྤྱད་པས། དེས་བྱང་ཆུབ་ཀྱང་མི་དམིགས་ན། སངས་རྒྱས་ལྟ་ཅི་སྨོས། སངས་རྒྱས་ཀྱི་ཆོས་ལྟ་ཡང་ཅི་སྨོས།
en: Through practicing the perfection of wisdom for a long time without apprehending anything, bodhisattva great beings do not apprehend even enlightenment, let alone the attributes of the buddhas!” “

source: བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱི་དེ་མ་ལགས་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གཞན་ལ་མི་སྤྱོད་དམ།
en: Blessed Lord, do bodhisattva great beings not practice the other perfections, apart from practicing the perfection of wisdom?” asked Śakra. “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་ཀུན་ལ་ཡང་། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་སྤྱོད་དེ།
en: Kauśika,” replied the Blessed One, “bodhisattva great beings indeed practice all six perfections, but they do so without apprehending anything.

source: དེས་སྦྱིན་པ་ཡང་མི་དམིགས། གཏོང་བ་ཡང་མི་དམིགས། ལེན་པ་ཡང་མི་དམིགས་སོ།
en: They do not apprehend gifts, they do not apprehend a giver, and they do not apprehend a recipient.

source: །ཚུལ་ཁྲིམས་ཀྱང་མི་དམིགས། ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཡང་མི་དམིགས། ཚུལ་ཁྲིམས་ངན་པ་ཡང་མི་དམིགས་སོ།
en: They do not apprehend ethical discipline, they do not apprehend one who is disciplined, and they do not apprehend immorality.

source: །བཟོད་པ་ཡང་མི་དམིགས། །བཟོད་པ་དང་ལྡན་པ་ཡང་མི་དམིགས། གནོད་སེམས་ཀྱང་མི་དམིགས་སོ།
en: They do not apprehend tolerance, they do not apprehend one who is tolerant, and they do not apprehend maliciousness.

source: །བརྩོན་འགྲུས་ཀྱང་མི་དམིགས། བརྩོན་འགྲུས་དང་ལྡན་པ་ཡང་མི་དམིགས། ལེ་ལོ་ཡང་མི་དམིགས་སོ།
en: They do not apprehend perseverance, they do not apprehend one who perseveres, and they do not apprehend indolence.

source: །བསམ་གཏན་ཡང་མི་དམིགས། བསམ་གཏན་དང་ལྡན་པ་ཡང་མི་དམིགས། འཁྲུག་པ་ཡང་མི་དམིགས་སོ།
en: They do not apprehend meditative concentration, they do not apprehend one who is concentrated, and they do not apprehend agitation.

source: །ཤེས་རབ་ཀྱང་མི་དམིགས། ཤེས་རབ་དང་ལྡན་པ་ཡང་མི་དམིགས། ཤེས་རབ་འཆལ་པ་ཡང་མི་དམིགས་སོ། །ཀཽ་ཤི་ཀ་འོན་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གཟུགས་མི་དམིགས་པའི་ཚུལ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་དམིགས་པའི་ཚུལ་དང་། མིག་མི་དམིགས་པའི་ཚུལ་དང་། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་མི་དམིགས་པའི་ཚུལ་དང་། གཟུགས་མི་དམིགས་པའི་ཚུལ་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་མི་དམིགས་པའི་ཚུལ་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་མི་དམིགས་པའི་ཚུལ་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་མི་དམིགས་པའི་ཚུལ་དང་། མིག་གི་འདུས་ཏེ་རེག་པ་མི་དམིགས་པའི་ཚུལ་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་།
en: They do not apprehend wisdom, they do not apprehend one who has wisdom, and they do not apprehend confusion. “

source: ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་མི་དམིགས་པའི་ཚུལ་དང་། མིག་གི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་མི་དམིགས་པའི་ཚུལ་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་མི་དམིགས་པའི་ཚུལ་དང་། སའི་ཁམས་མི་དམིགས་པའི་ཚུལ་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་མི་དམིགས་པའི་ཚུལ་དང་། མ་རིག་པ་མི་དམིགས་པའི་ཚུལ་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་། མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་། སྲེད་པ་དང་། ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་མི་དམིགས་པའི་ཚུལ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་དམིགས་པའི་ཚུལ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་དམིགས་པའི་ཚུལ་དང་། ནང་སྟོང་པ་ཉིད་མི་དམིགས་པའི་ཚུལ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མི་དམིགས་པའི་ཚུལ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་མི་དམིགས་པའི་ཚུལ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པའི་འཇུག་པ་རྣམས་མི་དམིགས་པའི་ཚུལ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: But, Kauśika, without apprehending physical forms; without apprehending feelings, perceptions, formative predispositions, or consciousness; without apprehending the eyes; without apprehending the ears, nose, tongue, body, or mental faculty; without apprehending sights; without apprehending sounds, odors, tastes, tangibles, or mental phenomena; without apprehending visual consciousness; without apprehending auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, or mental consciousness; without apprehending visually compounded sensory contact; without apprehending aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, or mentally compounded sensory contact; without apprehending feelings arising from visually compounded sensory contact; without apprehending feelings arising from aurally compounded sensory contact, feelings arising from nasally compounded sensory contact, feelings arising from lingually compounded sensory contact, feelings arising from corporeally compounded sensory contact, or feelings arising from mentally compounded sensory contact; without apprehending the earth element; without apprehending the water element, the fire element, the wind element, the space element, or the consciousness element; without apprehending ignorance; without apprehending formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, or aging and death; without apprehending the perfection of generosity; without apprehending the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom; without apprehending the emptiness of internal phenomena; without apprehending [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; {Ki.

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་མི་དམིགས་པའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མི་དམིགས་པའི་ཚུལ་དང་། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་།
en: II-III: 100} without apprehending the thirty-seven factors conducive to enlightenment; without apprehending the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, or the formless absorptions; without apprehending the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways of liberation, the five extrasensory powers, all the meditative stabilities, or all the dhāraṇī gateways; without apprehending the ten powers of the tathāgatas; without apprehending the fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, or the eighteen distinct qualities of the buddhas; and without apprehending the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, knowledge of the path, or all-aspect omniscience—without apprehending anything at all, the perfection of wisdom has primacy for bodhisattva great beings who dispense gifts in order to fulfill the perfection of generosity.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མི་དམིགས་པའི་ཚུལ་དང་། ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་ཚུལ་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་སྔོན་དུ་འགྲོ་བའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་བསྲུང་བའི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་སྔོན་དུ་འགྲོ་བའོ།
en: The perfection of wisdom has primacy for bodhisattva great beings who maintain morality in order to fulfill the perfection of ethical discipline.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པ་ཡོངས་སུ་སྒྲུབ་པའི། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་སྔོན་དུ་འགྲོ་བའོ།
en: The perfection of wisdom has primacy for bodhisattva great beings who practice tolerance in order to fulfill the perfection of tolerance.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་རྩོམ་པའི། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་སྔོན་དུ་འགྲོ་བའོ།
en: The perfection of wisdom has primacy for bodhisattva great beings who undertake perseverance in order to fulfill the perfection of perseverance.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་པའི། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་སྔོན་དུ་འགྲོ་བའོ།
en: The perfection of wisdom has primacy for bodhisattva great beings who are absorbed in meditative concentration in order to fulfill the perfection of meditative concentration.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ལ་རྣམ་པར་ལྟ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་སྔོན་དུ་འགྲོ་བའོ། །ཀཽ་ཤི་ཀ་འདི་ལྟ་སྟེ་དཔེར་ན། འཛམ་བུའི་གླིང་གི་ཤིང་རྣམས་ལོ་མ་སྣ་ཚོགས་ཅན།
en: The perfection of wisdom has primacy for those bodhisattva great beings who observe phenomena in order to fulfill the perfection of wisdom. “

source: མེ་ཏོག་སྣ་ཚོགས་ཅན། འབྲས་བུ་སྣ་ཚོགས་ཅན། དབྱིབས་སྣ་ཚོགས་ཅན། ཆུ་ཞེང་སྣ་ཚོགས་ཅན་དུ་འཁོད་ཀྱང་། དེ་དག་གི་གྲིབ་མ་ལ་ཁྱད་པར་རམ་བྱེ་བྲག་མི་དམིགས་ཏེ། གཞན་དུ་ན་གྲིབ་མ་གྲིབ་མ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོ་བར་ཟད་དོ། །ཀཽ་ཤི་ཀ་དེ་བཞིན་དུ་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པ།
en: Kauśika, just as the shade of the trees of Jambudvīpa, with their diverse foliage, diverse flowers, diverse fruits, diverse shapes, and diverse circumferences is apprehended, insofar as their shade is concerned, without distinctions or details, in the same way, Kauśika, in the case of the five other perfections that are acquired through the perfection of wisdom and are dedicated to the attainment of all-aspect omniscience, no distinctions or details are apprehended.”

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སུ་ཡོངས་སུ་བསྔོས་པ་རྣམས་ལ་ཡང་ཁྱད་པར་རམ་བྱེ་བྲག་མི་དམིགས་སོ། །བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡོན་ཏན་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པའི་སླད་དུ། ཡོན་ཏན་ཆེན་པོ་དང་ལྡན་པའོ།
en: Śakra then said, “Blessed Lord, the perfection of wisdom is endowed with great attributes in order that all enlightened attributes might be perfected.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡོན་ཏན་ཚད་མ་མཆིས་པ་དང་ལྡན་པའི་སླད་དུ། ཚད་མ་མཆིས་པའི་ཡོན་ཏན་དང་ལྡན་པའོ།
en: Blessed Lord, the perfection of wisdom is endowed with immeasurable attributes in order that immeasurable enlightened attributes might be possessed.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡོན་ཏན་མུ་མ་མཆིས་པ་དང་ལྡན་པའི་སླད་དུ། ཡོན་ཏན་ཀུན་དུ་མཐའ་ཡས་པ་དང་ལྡན་པའོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ། འདི་བྲིས་ཤིང་གླེགས་བམ་དུ་བགྱིས་ཏེ། བཅངས་པ་དང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བགྱིས། བཀུར་སྟིར་བགྱིས། བསྟི་སྟང་དུ་བགྱིས། མཆོད་པར་བགྱིས་ཏེ། དེ་ནས་གོང་དུ་ཇི་སྐད་བསྟན་པ་བཞིན་དུ།
en: Blessed Lord, the perfection of wisdom is endowed with limitless attributes in order that limitless enlightened attributes might be possessed. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིས་པ་དང་། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གླེགས་བམ་དུ་བགྱིས་ཏེ། གཞན་ལ་སྩལ་ན། དེ་གཉིས་ལས་གང་གི་བསོད་ནམས་ཆེར་འཕེལ་བར་འགྱུར།
en: Blessed Lord, if, on the one hand, any noble sons or noble daughters were to commit this perfection of wisdom to writing, make it into a book, and then keep it, serving, respecting, honoring, and worshiping it with flowers, garlands, perfume, unguents, incense, butter lamps, powders, religious robes, parasols, victory banners, ribbons, and diverse musical sounds, focusing their attention correctly on this perfection of wisdom, as mentioned before, and if, on the other hand, any noble sons or noble daughters were to make this perfection of wisdom into a book, and then bestow it upon others, which of these two would have the greater merit?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་བས་ན་ཁྱོད་ཉིད་ལ་དྲིས། ཁྱོད་ཀྱིས་ཇི་ལྟར་བཟོད་པ་དེ་ལྟར་ལུང་སྟོན་ཅིག། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ལ་ལས། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་མང་པོ་ལ། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: Rather than that, Kauśika,” replied the Blessed One, “I will ask you a question and you should answer as best you can!

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱས་བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་པ་དང་། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལས། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་ཡུངས་ཀར་གྱི་འབྲུ་ཙམ་ཞིག་གཞན་ལ་བྱིན་ཏེ་བགོ་བཤར་བྱས་པ་དང་། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལས། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་ཡུངས་ཀར་གྱི་འབྲུ་ཙམ་པོ་དེ་བླངས་ཏེ། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན། དེ་དག་ལས་གང་གི་བསོད་ནམས་ཆེར་འཕེལ་བ་ཡིན། བརྒྱ་ཕྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་ཏེ། དེ་ལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་མང་པོ་ལ་
en: Kauśika, in your opinion, which of these two has the greater merit: any noble sons or noble daughters who serve, respect, honor, and worship multiple bone relics of the tathāgatas with flowers, garlands, perfume, unguents, incense, butter lamps, powders, religious robes, parasols, victory banners, ribbons, and diverse musical sounds, or any noble sons or noble daughters who share a mustard seed-size bone relic of the tathāgatas with others, so that they, too, might receive a mustard seed-size relic of the tathāgatas, {Ki.

source: མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་།
en: II-III: 101} and then serve, respect, honor, and worship it with flowers, garlands, perfume, unguents, incense, butter lamps, powders, religious robes, parasols, victory banners, ribbons, and diverse musical sounds?”

source: རྒྱལ་མཚན་དང་བ་དན་དང་སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བགྱིས། བཀུར་སྟིར་བགྱིས། བསྟི་སྟང་དུ་བགྱིས། མཆོད་པར་བགྱིས་པ་བས་གང་ལ་ལས་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་ཡུངས་ཀར་གྱི་འབྲུ་ཙམ་གཞན་ལ་སྩལ་ན། འདི་ནི་དེ་བས་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Śakra answered, “Blessed Lord, as I understand the meaning of the words spoken by the Blessed One, if there are any who bestow a mustard seed-size bone relic of the tathāgatas on others, in contrast to those noble sons or noble daughters who serve, respect, honor, and worship multiple bone relics of the tathāgatas with flowers, garlands, perfume, unguents, incense, butter lamps, powders, religious robes, parasols, victory banners, ribbons, and diverse musical sounds, the former will accrue much greater merit. “

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཀྱང་དོན་དེ་ཉིད་གཟིགས་ཏེ། རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་ནས། རྡོ་རྗེ་ལྟ་བུའི་སྐུ་བཤིག་སྟེ།
en: Blessed Lord, considering this objective, the tathāgatas, arhats, completely awakened buddhas indeed become absorbed in the vajra-like meditative stability, and then their vajra-like body dissolves.

source: སེམས་ཅན་གྱི་རིས་ན། དེ་བཞིན་གཤེགས་པའི་རིང་བསྲེལ་གྱིས་འདུལ་བའི་སེམས་ཅན་མཆིས་པ་རྣམས་ཀྱི་སླད་དུ་ཐུགས་རྗེ་ཆེན་པོ་བསྐྱེད་དེ། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དུ་བྱིན་གྱིས་བརླབས་སོ།
en: Generating great compassion in the worlds of beings for the sake of those beings who can be trained by means of the pearl relics of the tathāgatas, they consecrate the bone relics of the tathāgatas.

source: །བཅོམ་ལྡན་འདས་གང་ལ་ལས་ཆུང་ངུ་ན། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་ཡུངས་ཀར་གྱི་འབྲུ་ཙམ་ལ། མཆོད་པ་སྣ་ཚོགས་ཀྱིས་མཆོད་པ་བགྱིས་ན། དེ་དག་ཐམས་ཅད་ཀྱང་དགེ་བའི་རྩ་བ་དེའི་མཐར་མ་ཐུག་པར་སྡུག་བསྔལ་གྱི་མཐར་འབྱིན་པར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, if any, however few, were to worship a mustard-seed size bone relic of the tathāgatas with various offerings, they would all put an end to suffering and their root of virtue would never end.” “

source: ཀཽ་ཤི་ཀ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་ལ་ལས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གླེགས་བམ་དུ་བྱས་ཏེ། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་།
en: Kauśika, it is so!

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱས།
en: It is so!”

source: བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས།
en: replied the Blessed One. “

source: མཆོད་པར་བྱས་པ་བས། གང་ལ་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཏེ། ཆོས་ཀྱི་དགའ་བས་གཞན་ལ་བྱིན་ན། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་ནི་བསོད་ནམས་ཆེར་འཕེལ་ལོ།
en: Kauśika, if any noble sons or noble daughters commit this perfection of wisdom to writing, and then bestow it upon others out of joy in the Dharma, their merit will be much greater than that of those noble sons or noble daughters who make this perfection of wisdom into a book and then serve, respect, honor, and worship it with flowers, garlands, perfume, unguents, incense, butter lamps, powders, religious robes, parasols, victory banners, ribbons, and diverse musical sounds. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ལ་ལས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཇི་སྐད་དུ་བསྟན་པ་བཞིན་དུ། གཞན་གྱི་དྲུང་དུ་སོང་སྟེ་བཤད་ཅིང་བསྟན་པ་དང་། བརྗོད་ཅིང་བཀྲོལ་བ་དང་། རྣམ་པར་ཕྱེ་སྟེ་གསལ་བར་བྱས་ན་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་ནི། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་སྔ་མ་དེ་དག་པས། བསོད་ནམས་ཆེར་འཕེལ་ཏེ།
en: Moreover, Kauśika, if any noble sons or noble daughters were to approach others and explain, teach, describe, interpret, disclose, or elucidate the perfection of wisdom, just as it has been taught, those noble sons or noble daughters would have greater merit than the former.

source: དེ་ནི་སྟོན་པ་ཡིན་པར་བསམ་མོ།
en: They would think of this [perfection of wisdom] as the Teacher.

source: །བླ་མའི་གནས་མཁས་པ་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ལ་ལ་ཞིག།
en: They would think of it as being worthy of respect, learned, and chaste in conduct.

source: ཡིན་པར་བསམ་མོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་སྟོན་པ་ཡིན་ཏེ།
en: If you ask why, Kauśika, this same perfection of wisdom is the Teacher.

source: སྟོན་པ་ནི་གཞན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གཞན་ཞེས་བྱ་བ་མེད་ཀྱི།
en: The Teacher is not one distinct thing and the perfection of wisdom another.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ཀྱང་སྟོན་པ། སྟོན་པ་ཉིད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Rather, the perfection of wisdom is indeed the Teacher and the Teacher is indeed the perfection of wisdom.
